#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <omp.h>

struct pal_t {
	int no;
	const char *name;
	int power;
	int idx;
};

struct pal_t pal_list[] = {
	{ 3, "タマコッコ", 1500, 62 },
	{ 16, "チョロゾウ", 1490, 14 },
	{ 24, "ニャオテト", 1480, 4 },
	{ 1, "モコロン", 1470, 27 },
	{ 2, "ツッパニャン", 1460, 46 },
	{ 18, "ミルフィー", 1455, 135 },
	{ 14, "タマモ", 1450, 79 },
	{ 24, "チルテト", 1440, 5 },
	{ 4, "クルリス", 1430, 7 },
	{ 32, "オバケナワ", 1422, 32 },
	{ 32, "シメナワ", 1420, 31 },
	{ 7, "ボルトラ", 1410, 65 },
	{ 70, "ラヴィ", 1405, 137 },
	{ 5, "キツネビ", 1400, 20 },
	{ 15, "ホウロック", 1390, 82 },
	{ 17, "ンダコアラ", 1380, 47 },
	{ 12, "パチグリ", 1370, 17 },
	{ 12, "コチグリ", 1360, 18 },
	{ 10, "ペンタマ", 1350, 23 },
	{ 27, "クルットリ", 1340, 8 },
	{ 6, "カモノスケ", 1330, 59 },
	{ 30, "イバラヒメ", 1320, 21 },
	{ 39, "ヒメウサ", 1310, 117 },
	{ 53, "コモップ", 1300, 114 },
	{ 23, "ヤミイカ", 1290, 85 },
	{ 28, "ポプリーナ", 1280, 91 },
	{ 81, "マグピス", 1270, 84 },
	{ 81, "ケルピス", 1260, 83 },
	{ 8, "エテッパ", 1250, 107 },
	{ 13, "ナエモチ", 1240, 112 },
	{ 13, "ナエモチ", 1240, 113 },
	{ 19, "ネムラム", 1230, 106 },
	{ 22, "モグルン", 1220, 101 },
	{ 62, "カミナラシ", 1210, 24 },
	{ 34, "メリポップ", 1190, 39 },
	{ 21, "ルナティ", 1180, 121 },
	{ 76, "フォレーナ", 1160, 80 },
	{ 9, "ヒノコジカ", 1155, 138 },
	{ 66, "ソルレイス", 1150, 51 },
	{ 45, "ダリザード", 1140, 58 },
	{ 20, "イノボウ", 1130, 6 },
	{ 45, "ダリザード", 1120, 57 },
	{ 63, "ミステリア", 1110, 22 },
	{ 31, "シャーマンダー", 1100, 26 },
	{ 31, "シャーキッド", 1090, 25 },
	{ 44, "マスクロウ", 1080, 44 },
	{ 50, "ビーナイト", 1070, 95 },
	{ 26, "ガウルフ", 1060, 15 },
	{ 78, "ヴィオレッタ", 1050, 89 },
	{ 49, "ゴリレイジ", 1040, 16 },
	{ 47, "エアムルグ", 1030, 12 },
	{ 48, "フェザーロ", 1020, 52 },
	{ 94, "ヤミトバリ", 1010, 70 },
	{ 48, "サンドロ", 1000, 53 },
	{ 77, "ラベロット", 990, 103 },
	{ 93, "ムラクモ", 980, 48 },
	{ 46, "ツキカゲ", 950, 30 },
	{ 69, "ラブマンダー", 940, 81 },
	{ 35, "ベリゴート", 930, 75 },
	{ 37, "ツノガミ", 920, 9 },
	{ 29, "ミルカルビ", 910, 86 },
	{ 37, "ツノガミ", 900, 10 },
	{ 43, "トドドドン", 895, 136 },
	{ 36, "メルパカ", 890, 41 },
	{ 59, "ツララジカ", 880, 76 },
	{ 25, "ルミカイト", 870, 128 },
	{ 86, "ラブラドン", 860, 71 },
	{ 67, "ドリタス", 850, 11 },
	{ 86, "ラブラドン", 840, 72 },
	{ 61, "シラヌイ", 830, 56 },
	{ 64, "アロアリュー", 820, 63 },
	{ 64, "ビリビリリュー", 810, 64 },
	{ 55, "オコチョ", 800, 123 },
	{ 42, "ブルフェルノ", 790, 99 },
	{ 87, "フラリーナ", 780, 130 },
	{ 57, "フブキツネ", 760, 104 },
	{ 68, "ニャンバット", 750, 96 },
	{ 60, "イヌズマ", 740, 100 },
	{ 84, "ゴクエンオ", 710, 108 },
	{ 75, "クレメーオ", 700, 116 },
	{ 56, "ライコーン", 680, 19 },
	{ 84, "ゴクエンオ", 670, 109 },
	{ 71, "カバネドリ", 660, 60 },
	{ 72, "ツジギリ", 640, 127 },
	{ 71, "シロカバネ", 620, 61 },
	{ 40, "ヘルゴート", 590, 2 },
	{ 40, "アビスゴート", 580, 3 },
	{ 100, "アヌビス", 570, 1 },
	{ 65, "シーペント", 560, 42 },
	{ 65, "スナペント", 550, 43 },
	{ 80, "シルフィア", 540, 37 },
	{ 80, "シルティア", 530, 38 },
	{ 11, "キャプペン", 520, 122 },
	{ 52, "ニャンギマリ", 510, 131 },
	{ 82, "アズレーン", 500, 45 },
	{ 41, "パピテフ", 490, 132 },
	{ 91, "ヒエティ", 480, 88 },
	{ 89, "アルパオー", 470, 110 },
	{ 91, "ヒエティ", 460, 87 },
	{ 79, "シルキーヌ", 450, 78 },
	{ 89, "アルパオー", 440, 111 },
	{ 33, "ササゾー", 430, 97 },
	{ 38, "ホークウィン", 420, 90 },
	{ 54, "ドンモップ", 410, 115 },
	{ 33, "ササゾー", 390, 98 },
	{ 74, "イグニクス", 380, 126 },
	{ 105, "ホルス", 370, 73 },
	{ 58, "サラブレイズ", 360, 35 },
	{ 95, "フェスキー", 350, 124 },
	{ 92, "グラクレス", 340, 119 },
	{ 51, "クインビーナ", 330, 94 },
	{ 88, "ボルカノン", 320, 49 },
	{ 101, "アグニドラ", 315, 29 },
	{ 101, "レヴィドラ", 310, 28 },
	{ 90, "グランモス", 300, 68 },
	{ 90, "ブリザモス", 290, 69 },
	{ 85, "ペコドン", 280, 54 },
	{ 85, "パリピドン", 270, 55 },
	{ 99, "デスティング", 260, 133 },
	{ 104, "リリクイン", 250, 92 },
	{ 58, "サラブレイズ", 240, 36 },
	{ 88, "ボルカノン", 230, 50 },
	{ 73, "ライバード", 220, 118 },
	{ 104, "リリクイン", 210, 93 },
	{ 103, "エレパンダ", 200, 13 },
	{ 97, "ヘルガルダ", 190, 125 },
	{ 98, "ジオラーヴァ", 150, 102 },
	{ 106, "ボルゼクス", 140, 134 },
	{ 83, "ツンドラー", 130, 40 },
	{ 110, "グレイシャル", 120, 66 },
	{ 110, "グレイシャドウ", 100, 67 },
	{ 111, "ジェットラン", 90, 105 },
	{ 108, "セイントール", 80, 120 },
	{ 109, "ベイントール", 70, 129 },
	{ 107, "ゼノグリフ", 60, 77 },
	{ 102, "スザク", 50, 33 },
	{ 102, "シヴァ", 30, 34 },
	{ 96, "ボルカイザー", 10, 74 },
};

// r,p1,p2
int uniq_bleed[] = {
	55,54,65,
	3,2,51,
	5,4,23,
	61,60,104,
	10,9,31,
	38,37,42,
	36,35,116,
	69,68,87,
	98,97,13,
	64,63,100,
	18,17,23,
	67,66,125,
	111,110,76,
	93,92,133,
	58,57,137,
	109,108,70,
	53,52,101,
	72,71,59,
	43,42,136,
	26,25,138,
	34,33,28,
	50,49,104,
	32,31,114,
	92,97,130,
	73,60,1,
	13,97,100,
	134,13,54,
	77,56,102
};

int bleed_table[1501] = { 0 };

void create_table() {
	for(int p = 0; p < 1501; p++) {
		int dif = 3000;
		int idx = 9999;
		int iid = 9999;
		
		for(int i = 0; i < 138; i++) {
			int q = pal_list[i].power;
			int ldif = p < q ? q - p : p - q;
			if(dif > ldif || (dif == ldif && iid > pal_list[i].idx)) {
				dif = ldif;
				idx = i;
				iid = pal_list[i].idx;
			}
		}
		
		bleed_table[p] = idx;
	}
}

int bleed(int a, int b) {
	int idx_a = pal_list[a].idx;
	int idx_b = pal_list[b].idx; 
	
	for(int i = 0; i < 28; i++) {
		if((uniq_bleed[i*3+1] == idx_a && uniq_bleed[i*3+2] == idx_b) || (uniq_bleed[i*3+1] == idx_b && uniq_bleed[i*3+2] == idx_a)) {
			int ridx = uniq_bleed[i*3+0];
			
			for(int i = 0; i < 138; i++) {
				if(pal_list[i].idx == ridx) return i;
			}
		}
	}
	
	int r = (pal_list[a].power + pal_list[b].power) / 2;
	
	return bleed_table[r];
};

int abs_base = 0;

int get_pal(int target) {
	for(int i = 0; i < 138; i++) {
		if(pal_list[i].power == target) return i;
	}
	return -1;
}

void print_pal(int r) {
	printf("No.%d %s (Power %d)", pal_list[r].no, pal_list[r].name, pal_list[r].power);
}

void dump_result(int *res, int base, int target) {
	printf("## ");
	print_pal(target);
	printf("  \n");
	
	for(int i = 0; i < 138; i++) {
		if(res[i]) {
			printf("- ");
			print_pal(i);
			printf(" + ");
			print_pal(base);
			printf("  \n");
		}
	}
}

int search_pal(int idx_base, int idx_target, int gen, int maxgen, int *res) {
	int next_target_a[138] = { 0 };
	int next_target_b[138] = { 0 };
	
	int bleeded_count = 0;
	
	for(int i = 0; i < 138; i++) {
		for(int j = i; j < 138; j++) {
			if(i == idx_target || j == idx_target) continue;
			
			int r = bleed(i, j);
			
			if(r == idx_target && (i == idx_base || j == idx_base)) {
				res[i == idx_base ? j : i] = 1;
				bleeded_count++;
			} else if (r == idx_target && i != idx_base && j != idx_base) {
				next_target_a[i] = 1;
				next_target_b[i] = j;
			}
		}
	}
	
	
	if(gen == maxgen) return bleeded_count;
	
	int cres[138][138];
	int ccount[138];
	
	printf("# %d-Gen Combo\n", gen + 2);
	
	for(int i = 0; i < 138; i++) {
		if(next_target_a[i]) {
			printf("- ");
			print_pal(i);
			puts("");
		}
	}
	
	int search_list[138];
	int search_cnt = 0;
	
	for(int i = 0; i < 138; i++) {
		if(next_target_a[i]) {
			search_list[search_cnt] = i;
			search_cnt++;
		}
	}
	
#pragma omp parallel for
	for(int k = 0; k < search_cnt; k++) {
		int i = search_list[k];
		int j = next_target_b[i];
		memset(cres[i], 0, 138 * sizeof(int));
		
		ccount[i] = search_pal(idx_base, i, gen + 1, maxgen, cres[i]);
	}
	
	puts("");
	
	for(int i = 0; i < 138; i++) {
		if(ccount[i] > 0) {
			dump_result(cres[i], idx_base, i);
			puts("");
		}
	}
	
	puts("");
	
	return bleeded_count;
}

int main(int argc, char *argv[]) {
	int maxgen = atoi(argv[1]);
	int target = atoi(argv[2]);
	int base = atoi(argv[3]);
	
	if(argc > 4) abs_base = atoi(argv[4]);
	
	int idx_base = get_pal(base);
	int idx_target = get_pal(target);
	
	create_table();
	
	int res[138] = { 0 };
	search_pal(idx_base, idx_target, 0, maxgen, res);
	
	printf("# 1-Gen Combo\n");
	dump_result(res, idx_base, idx_target);
	
	return 0;
};
