#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <omp.h>

struct pal_t {
	int no;
	const char *name;
	int power;
};

struct pal_t pal_list[] = {
	{ 3, "タマコッコ", 1500 },
	{ 16, "チョロゾウ", 1490 },
	{ 24, "ニャオテト", 1480 },
	{ 1, "モコロン", 1470 },
	{ 2, "ツッパニャン", 1460 },
	{ 18, "ミルフィー", 1455 },
	{ 14, "タマモ", 1450 },
	{ 24, "チルテト", 1440 },
	{ 4, "クルリス", 1430 },
	{ 32, "オバケナワ", 1422 },
	{ 32, "シメナワ", 1420 },
	{ 7, "ボルトラ", 1410 },
	{ 70, "ラヴィ", 1405 },
	{ 5, "キツネビ", 1400 },
	{ 15, "ホウロック", 1390 },
	{ 17, "ンダコアラ", 1380 },
	{ 12, "パチグリ", 1370 },
	{ 12, "コチグリ", 1360 },
	{ 10, "ペンタマ", 1350 },
	{ 27, "クルットリ", 1340 },
	{ 6, "カモノスケ", 1330 },
	{ 30, "イバラヒメ", 1320 },
	{ 39, "ヒメウサ", 1310 },
	{ 53, "コモップ", 1300 },
	{ 23, "ヤミイカ", 1290 },
	{ 28, "ポプリーナ", 1280 },
	{ 81, "マグピス", 1270 },
	{ 81, "ケルピス", 1260 },
	{ 8, "エテッパ", 1250 },
	{ 13, "ナエモチ", 1240 },
	{ 13, "ナエモチ", 1240 },
	{ 19, "ネムラム", 1230 },
	{ 22, "モグルン", 1220 },
	{ 62, "カミナラシ", 1210 },
	{ 34, "メリポップ", 1190 },
	{ 21, "ルナティ", 1180 },
	{ 76, "フォレーナ", 1160 },
	{ 9, "ヒノコジカ", 1155 },
	{ 66, "ソルレイス", 1150 },
	{ 45, "ダリザード", 1140 },
	{ 20, "イノボウ", 1130 },
	{ 45, "ダリザード", 1120 },
	{ 63, "ミステリア", 1110 },
	{ 31, "シャーマンダー", 1100 },
	{ 31, "シャーキッド", 1090 },
	{ 44, "マスクロウ", 1080 },
	{ 50, "ビーナイト", 1070 },
	{ 26, "ガウルフ", 1060 },
	{ 78, "ヴィオレッタ", 1050 },
	{ 49, "ゴリレイジ", 1040 },
	{ 47, "エアムルグ", 1030 },
	{ 48, "フェザーロ", 1020 },
	{ 94, "ヤミトバリ", 1010 },
	{ 48, "サンドロ", 1000 },
	{ 77, "ラベロット", 990 },
	{ 93, "ムラクモ", 980 },
	{ 46, "ツキカゲ", 950 },
	{ 69, "ラブマンダー", 940 },
	{ 35, "ベリゴート", 930 },
	{ 37, "ツノガミ", 920 },
	{ 29, "ミルカルビ", 910 },
	{ 37, "ツノガミ", 900 },
	{ 43, "トドドドン", 895 },
	{ 36, "メルパカ", 890 },
	{ 59, "ツララジカ", 880 },
	{ 25, "ルミカイト", 870 },
	{ 86, "ラブラドン", 860 },
	{ 67, "ドリタス", 850 },
	{ 86, "ラブラドン", 840 },
	{ 61, "シラヌイ", 830 },
	{ 64, "アロアリュー", 820 },
	{ 64, "ビリビリリュー", 810 },
	{ 55, "オコチョ", 800 },
	{ 42, "ブルフェルノ", 790 },
	{ 87, "フラリーナ", 780 },
	{ 57, "フブキツネ", 760 },
	{ 68, "ニャンバット", 750 },
	{ 60, "イヌズマ", 740 },
	{ 84, "ゴクエンオ", 710 },
	{ 75, "クレメーオ", 700 },
	{ 56, "ライコーン", 680 },
	{ 84, "ゴクエンオ", 670 },
	{ 71, "カバネドリ", 660 },
	{ 72, "ツジギリ", 640 },
	{ 71, "シロカバネ", 620 },
	{ 40, "ヘルゴート", 590 },
	{ 40, "アビスゴート", 580 },
	{ 100, "アヌビス", 570 },
	{ 65, "シーペント", 560 },
	{ 65, "スナペント", 550 },
	{ 80, "シルフィア", 540 },
	{ 80, "シルティア", 530 },
	{ 11, "キャプペン", 520 },
	{ 52, "ニャンギマリ", 510 },
	{ 82, "アズレーン", 500 },
	{ 41, "パピテフ", 490 },
	{ 91, "ヒエティ", 480 },
	{ 89, "アルパオー", 470 },
	{ 91, "ヒエティ", 460 },
	{ 79, "シルキーヌ", 450 },
	{ 89, "アルパオー", 440 },
	{ 33, "ササゾー", 430 },
	{ 38, "ホークウィン", 420 },
	{ 54, "ドンモップ", 410 },
	{ 33, "ササゾー", 390 },
	{ 74, "イグニクス", 380 },
	{ 105, "ホルス", 370 },
	{ 58, "サラブレイズ", 360 },
	{ 95, "フェスキー", 350 },
	{ 92, "グラクレス", 340 },
	{ 51, "クインビーナ", 330 },
	{ 88, "ボルカノン", 320 },
	{ 101, "アグニドラ", 315 },
	{ 101, "レヴィドラ", 310 },
	{ 90, "グランモス", 300 },
	{ 90, "ブリザモス", 290 },
	{ 85, "ペコドン", 280 },
	{ 85, "パリピドン", 270 },
	{ 99, "デスティング", 260 },
	{ 104, "リリクイン", 250 },
	{ 58, "サラブレイズ", 240 },
	{ 88, "ボルカノン", 230 },
	{ 73, "ライバード", 220 },
	{ 104, "リリクイン", 210 },
	{ 103, "エレパンダ", 200 },
	{ 97, "ヘルガルダ", 190 },
	{ 98, "ジオラーヴァ", 150 },
	{ 106, "ボルゼクス", 140 },
	{ 83, "ツンドラー", 130 },
	{ 110, "グレイシャル", 120 },
	{ 110, "グレイシャドウ", 100 },
	{ 111, "ジェットラン", 90 },
	{ 108, "セイントール", 80 },
	{ 109, "ベイントール", 70 },
	{ 107, "ゼノグリフ", 60 },
	{ 102, "スザク", 50 },
	{ 102, "シヴァ", 30 },
	{ 96, "ボルカイザー", 10 }
};

int pal_idx[] = {
	1500,62,
	1490,14,
	1480,4,
	1470,27,
	1460,46,
	1455,135,
	1450,79,
	1440,5,
	1430,7,
	1422,32,
	1420,31,
	1410,65,
	1405,137,
	1400,20,
	1390,82,
	1380,47,
	1370,17,
	1360,18,
	1350,23,
	1340,8,
	1330,59,
	1320,21,
	1310,117,
	1300,114,
	1290,85,
	1280,91,
	1270,84,
	1260,83,
	1250,107,
	1240,112,
	1240,113,
	1230,106,
	1220,101,
	1210,24,
	1190,39,
	1180,121,
	1160,80,
	1155,138,
	1150,51,
	1140,58,
	1130,6,
	1120,57,
	1110,22,
	1100,26,
	1090,25,
	1080,44,
	1070,95,
	1060,15,
	1050,89,
	1040,16,
	1030,12,
	1020,52,
	1010,70,
	1000,53,
	990,103,
	980,48,
	950,30,
	940,81,
	930,75,
	920,9,
	910,86,
	900,10,
	895,136,
	890,41,
	880,76,
	870,128,
	860,71,
	850,11,
	840,72,
	830,56,
	820,63,
	810,64,
	800,123,
	790,99,
	780,130,
	760,104,
	750,96,
	740,100,
	710,108,
	700,116,
	680,19,
	670,109,
	660,60,
	640,127,
	620,61,
	590,2,
	580,3,
	570,1,
	560,42,
	550,43,
	540,37,
	530,38,
	520,122,
	510,131,
	500,45,
	490,132,
	480,88,
	470,110,
	460,87,
	450,78,
	440,111,
	430,97,
	420,90,
	410,115,
	390,98,
	380,126,
	370,73,
	360,35,
	350,124,
	340,119,
	330,94,
	320,49,
	315,29,
	310,28,
	300,68,
	290,69,
	280,54,
	270,55,
	260,133,
	250,92,
	240,36,
	230,50,
	220,118,
	210,93,
	200,13,
	190,125,
	150,102,
	140,134,
	130,40,
	120,66,
	100,67,
	90,105,
	80,120,
	70,129,
	60,77,
	50,33,
	30,34,
	10,74
};

// r,p1,p2
int uniq_bleed[] = {
	55,54,65,
	3,2,51,
	5,4,23,
	61,60,104,
	10,9,31,
	38,37,42,
	36,35,116,
	69,68,87,
	98,97,13,
	64,63,100,
	18,17,23,
	67,66,125,
	111,110,76,
	93,92,133,
	58,57,137,
	109,108,70,
	53,52,101,
	72,71,59,
	43,42,136,
	26,25,138,
	34,33,28,
	50,49,104,
	32,31,114,
	92,97,130,
	73,60,1,
	13,97,100,
	134,13,54,
	77,56,102
};

int bleed_table[1501] = { 0 };

void create_table() {
	for(int p = 0; p < 1501; p++) {
		int dif = 3000;
		int idx = 9999;
		int iid = 9999;
		
		for(int i = 0; i < 138; i++) {
			int q = pal_list[i].power;
			int ldif = p < q ? q - p : p - q;
			if(dif > ldif || (dif == ldif && iid > pal_idx[i*2+1])) {
				dif = ldif;
				idx = i;
				iid = pal_idx[i*2+1];
			}
		}
		
		bleed_table[p] = idx;
		
		//printf("pwr %d -> No.%03d \"%s\" (pwr %d, dif %d)\n", p, pal_list[idx].no, pal_list[idx].name, pal_list[idx].power, dif);
	}
}

// both : power
int bleed(int a, int b) {
	int na = 0;
	int nb = 0; 
	
	for(int i = 0; i < 138; i++) {
		if(pal_idx[i*2+0] == a) na = pal_idx[i*2+1];
		if(pal_idx[i*2+0] == b) nb = pal_idx[i*2+1];
	}
	
	for(int i = 0; i < 28; i++) {
		if((uniq_bleed[i*3+1] == na && uniq_bleed[i*3+2] == nb) || (uniq_bleed[i*3+1] == nb && uniq_bleed[i*3+2] == na)) {
			int ii = uniq_bleed[i*3+0];
			int pow = 0;
			
			printf("uniq!(internal) : %d = %d + %d\n", ii, na, nb);
			
			for(int i = 0; i < 138; i++) {
				if(pal_idx[i*2+1] == ii) pow = pal_idx[i*2+0];
			}
			
			printf("uniq pow = %d\n", pow);
			
			for(int i = 0; i < 138; i++) {
				if(pal_list[i].power == pow) return i;
			}
		}
	}
	
	int r = (a+b)/2;
	return bleed_table[r];
};

int abs_base = 0;

// base / target : power
int search_pal(int base, int target, int gen, int maxgen) {
	int tgt = 0;
	int bas = 0; 
	
	for(int i = 0; i < 138; i++) {
		if(pal_list[i].power == target) tgt = i;
		if(pal_list[i].power == base) bas = i;
	}
	
	int bleeded = 0;
	
//#pragma omp parallel for
	for(int i = 0; i < 138; i++) {
		if(pal_list[i].power < abs_base) continue;
		int r = bleed(base, pal_list[i].power);

		if(r == tgt) {
			for(int _t=0;_t<maxgen-gen;_t++) putchar('\t');
			printf("Gen:T+00 %s(%d) = %s(%d) + %s(%d)\n", pal_list[r].name, pal_list[r].power, pal_list[bas].name, pal_list[bas].power, pal_list[i].name, pal_list[i].power);

			bleeded = 1;
		} else if(maxgen > gen) {
			int r2 = search_pal(pal_list[r].power, target, gen + 1, maxgen);
			if(r2 == -2) {
				for(int _t=0;_t<maxgen-gen;_t++) putchar('\t');
				printf("Gen:T-%02d %s(%d) = %s(%d) + %s(%d)\n", maxgen-gen, pal_list[r].name, pal_list[r].power, pal_list[bas].name, pal_list[bas].power, pal_list[i].name, pal_list[i].power);
				bleeded = 1;
			}
		}
	}
	
	return bleeded ? -2 : -1;
}

int main(int argc, char *argv[]) {
	int maxgen = atoi(argv[1]);
	int target = atoi(argv[2]);
	int base = atoi(argv[3]);
	
	if(argc > 4) abs_base = atoi(argv[4]);
	
	int nb, nt;
	
	for(int i = 0; i < 138; i++) {
		if(pal_list[i].power == target) nt = i;
		if(pal_list[i].power == base) nb = i;
	}
	
	create_table();
	
	printf("%s to %s, maxgen = %d\n\n", pal_list[nb].name, pal_list[nt].name, maxgen);
	int r = search_pal(base, target, 0, maxgen);
	
	return 0;
};
